In [1]:
import pandas as pd
import numpy as np

In [2]:
orders_df = pd.read_csv("assets/orders.csv")
orders_df.head()

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item
0,2714054,469662,21386,2015-10-15 08:50:56.000,597982.0,محمود آباد,1.0
1,11104039,3063877,248497,2018-02-11 00:29:26.000,980000.0,خرمدره,1.0
2,4228130,3184893,50144,2016-06-14 00:30:08.000,229358.0,قرچک,1.0
3,22225624,6888562,70208,2018-09-03 14:37:19.000,16514.0,قم,1.0
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028.0,تهران,1.0

In [3]:
orders_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Order               200000 non-null  int64
 1   ID_Customer            200000 non-null  int64
 2   ID_Item                200000 non-null  int64
 3   DateTime_CartFinalize  200000 non-null  str
 4   Amount_Gross_Order     200000 non-null  float64
 5   city_name_fa           200000 non-null  str
 6   Quantity_item          200000 non-null  float64
dtypes: float64(2), int64(3), str(2)
memory usage: 17.0 MB

In [4]:
# converting str to datetime for the order date column
orders_df.DateTime_CartFinalize = orders_df.DateTime_CartFinalize.astype('datetime64[ns]')

### Things I need to know about this dataset

- Time Period of this data
- aggregation using group by for various scenarios

In [5]:
# فاصله زمانی این دیتاست: کم‌ترین زمان تا بیشترین زمان
min_date = orders_df.DateTime_CartFinalize.min()
max_date = orders_df.DateTime_CartFinalize.max()
print(f"Dataset Time Period: from {min_date} to {max_date}")

Dataset Time Period: from 2013-09-27 12:03:00 to 2018-12-11 04:47:23

In [9]:
# به دست آوردن تاریخ آخرین خرید هر مشتری
orders_df['last_transaction_date'] = orders_df.groupby('ID_Customer')['DateTime_CartFinalize'].transform(max)
orders_df

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,last_transaction_date
0,2714054,469662,21386,2015-10-15 08:50:56,597982.0,محمود آباد,1.0,2018-07-08 10:48:54
1,11104039,3063877,248497,2018-02-11 00:29:26,980000.0,خرمدره,1.0,2018-02-11 00:29:26
2,4228130,3184893,50144,2016-06-14 00:30:08,229358.0,قرچک,1.0,2016-12-21 13:40:12
3,22225624,6888562,70208,2018-09-03 14:37:19,16514.0,قم,1.0,2018-09-03 14:37:19
4,4068771,2533490,67627,2016-05-21 11:51:02,133028.0,تهران,1.0,2016-05-21 11:51:02
...,...,...,...,...,...,...,...,...
199995,12172771,4403268,445940,2018-04-03 12:07:01,344037.0,تهران,2.0,2018-04-03 12:07:01
199996,4425393,3745774,131645,2016-07-09 19:14:09,600000.0,محمدیه,1.0,2016-07-09 19:14:09
199997,6671889,4845514,215045,2017-03-08 23:47:06,450000.0,اصفهان,1.0,2017-03-08 23:47:06
199998,6315995,2541418,264021,2017-02-08 14:59:39,193486.0,همدان,1.0,2017-12-21 00:42:47
199999,7584127,1342585,89427,2017-06-17 10:08:06,55046.0,بندر انزلی,1.0,2017-09-25 15:31:40

In [ ]:
# Making sure last_trancation_date is correct for a random customer
orders_df[orders_df.ID_Customer == 469662 ]

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,last_transaction_date
0,2714054,469662,21386,2015-10-15 08:50:56,597982.0,محمود آباد,1.0,2018-07-08 10:48:54
18657,4108025,469662,165970,2016-05-27 13:09:16,141826.0,محمود آباد,1.0,2018-07-08 10:48:54
30887,4108025,469662,167534,2016-05-27 13:09:16,82569.0,محمود آباد,1.0,2018-07-08 10:48:54
45054,4266993,469662,64680,2016-06-19 17:33:03,82569.0,محمود آباد,1.0,2018-07-08 10:48:54
166816,13936681,469662,407265,2018-07-08 10:48:54,18349.0,محمود آباد,5.0,2018-07-08 10:48:54
177264,2365593,469662,66728,2015-07-30 15:30:39,100917.0,محمود آباد,1.0,2018-07-08 10:48:54

In [18]:
# Creating a new DF for RFM values for each customer
rfm_df = pd.DataFrame(pd.unique(orders_df.ID_Customer), columns=['Customer_ID'])
rfm_df

        Customer_ID
0            469662
1           3063877
2           3184893
3           6888562
4           2533490
...             ...
151629      4625961
151630      3720408
151631      4403268
151632      3745774
151633      4845514

[151634 rows x 1 columns]

In [21]:
# Calculating the R value for each customer
rfm_df['r_value'] = (pd.to_datetime('2019-01-01') - orders_df.last_transaction_date).dt.days
rfm_df['r_value']

0         176
1         323
2         740
3         119
4         954
         ...
151629    376
151630    869
151631    195
151632    108
151633    252
Name: r_value, Length: 151634, dtype: int64

In [24]:
# Calculating the F value for each customer
rfm_df['f_value'] = orders_df.groupby('ID_Customer')['DateTime_CartFinalize'].transform('count')
rfm_df

        Customer_ID  r_value  f_value
0            469662      176        6
1           3063877      323        1
2           3184893      740        3
3           6888562      119        1
4           2533490      954        1
...             ...      ...      ...
151629      4625961      376        2
151630      3720408      869        2
151631      4403268      195        1
151632      3745774      108        1
151633      4845514      252        1

[151634 rows x 3 columns]

In [34]:
sum_sales_amount = orders_df.groupby('ID_Customer')['Amount_Gross_Order'].transform(sum)
sum_quantities = orders_df.groupby('ID_Customer')['Quantity_item'].transform(sum)

rfm_df['m_value'] = sum_sales_amount / sum_quantities
rfm_df

        Customer_ID  r_value  f_value       m_value
0            469662      176        6  1.024212e+05
1           3063877      323        1  9.800000e+05
2           3184893      740        3  1.732570e+05
3           6888562      119        1  1.651400e+04
4           2533490      954        1  1.330280e+05
...             ...      ...      ...           ...
151629      4625961      376        2  1.143394e+06
151630      3720408      869        2  1.000816e+05
151631      4403268      195        1  3.800000e+05
151632      3745774      108        1  6.200000e+05
151633      4845514      252        1  5.030583e+04

[151634 rows x 4 columns]

In [ ]:
# Calculating the M value for each customer
rfm_df['m_value'] = orders_df.groupby('ID_Customer')['DateTime_CartFinalize'].transform('count')
rfm_df